#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gcs_api_extract.google_storage_bucket.buckets["rapidapi-genius-api-extracts"] will be created
  + resource "google_storage_bucket" "buckets" {
      + default_event_based_hold    = false
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "name"              = "pricing-aggregator-us-east1-rapidapi-genius-api-extracts"
          + "project_name"      = "pricing-aggregator"
          + "project_workspace" = "exemplary-tide-379122"
        }
      + location                    = "US-EAST1"
      + name                        = "pricing-aggregator-us-east1-rapidapi-genius-api-extracts"
      + project                     = "exemplary-tide-379122"
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = false
        }
    }

  # module.gcs_api_extract.google_storage_bucket_iam_binding.admins["rapidapi-genius-api-extracts"] will be created
  + resource "google_storage_bucket_iam_binding" "admins" {
      + bucket  = "pricing-aggregator-us-east1-rapidapi-genius-api-extracts"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "group:kevinsunny1996@gmail.com",
        ]
      + role    = "roles/storage.objectAdmin"
    }

  # module.gcs_api_extract.random_id.bucket_suffix will be created
  + resource "random_id" "bucket_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kevinsunny1996, Action: `pull_request`*